---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SiteFailures
source: html/7ab66d74-f1ab-17f6-9ecf-e51b3d5326bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures

Failures about Site.

## Syntax (C#)
```csharp
public static class SiteFailures
```